<?php
namespace Home\Controller;
use Think\Controller;
class IndexController extends Controller {
    public function index(){
    	$this->display ();
    }
    
    public function bus($str){
        $data=array(
            '开发区1路'=>array(
                array(120.240648,36.054587),
                array(120.004914,35.877262),
                array(120.172229,35.980938),
                array(120.172229,35.980938),
                array(120.196159,35.968639),
                array(120.211062,35.981357),
                array(120.250947,35.966188)
            ),
            '开发区18路'=>array(
                '鲁BH8312'=>array(120.239674,36.053187),
                '鲁BH8313'=>array(120.004914,35.877262),
                '鲁BH8314'=>array(120.17877,35.970426),
                '鲁BH8315'=>array(120.188097,35.956214),
                '鲁BH8316'=>array(120.211062,35.981357),
                '鲁BH8317'=>array(120.250947,35.966188)
            ),
            '开发区4路'=>array(
                '鲁BH8312'=>array(120.110104,35.928958),
                '鲁BH8313'=>array(120.162374,35.944518),
                '鲁BH8314'=>array(120.047164,35.883104),
                '鲁BH8315'=>array(120.188097,35.956214),
                '鲁BH8316'=>array(120.211062,35.981357),
                '鲁BH8317'=>array(120.250947,35.966188)
            ),
            '开发区26路'=>array(
                '鲁BH8312'=>array(120.239674,36.053187),
                '鲁BH8313'=>array(120.004914,35.877262),
                '鲁BH8317'=>array(120.250947,35.966188)
            )
        );
        $arr['data']=$data[$str];
        echo json_encode($arr);
    }

    public function all(){
        $data=array(
            array(120.239674,36.053187),
            array(120.004914,35.877262),
            array(120.172229,35.980938),
            array(120.172229,35.980938),
            array(120.196159,35.968639),
            array(120.211062,35.981357),
            array(120.250947,35.966188),
            array(120.239674,36.053187),
            array(120.004914,35.877262),
            array(120.17877,35.970426),
            array(120.188097,35.956214),
            array(120.211062,35.981357),
            array(120.250947,35.966188),
            array(120.110104,35.928958),
            array(120.162374,35.944518),
            array(120.047164,35.883104),
            array(120.188097,35.956214),
            array(120.211062,35.981357),
            array(120.250947,35.966188),
            array(120.239674,36.053187),
            array(120.004914,35.877262),
            array(120.250947,35.966188)
        );
        $arr['data']=$data;
        echo json_encode($arr);
    }
}